app/views/tweets/show.html.erb

  <% if @tweet.user_id != current_user.id %>
    <% if Room.find_by(sender_id: current_user.id, tweet_id: @tweet.id)%>
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`sender_id` = 2 AND `rooms`.`tweet_id` = 1 LIMIT 1