app/views/users/show.html.erb

<h2>ユーザーの投稿一覧</h2>
<% @user.tweets.each do |t| %>
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2

        <div class="tweet">
        <% sender = User.find(room.sender_id) %>
        <% tweet = Tweet.find(room.tweet_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1


        <% owner = User.find(room.owner_id) %>
        <% tweet = Tweet.find(room.tweet_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]