app/controllers/messages_controller.rb

    def create

        message = Message.new(message_params)
        message.user_id = current_user.id
        message.room_id = params[:id] #params[:id] は@tweet.idではダメ
        message.save
        room = Room.find(message.room_id)
---
INSERT INTO `messages` (`room_id`, `body`, `user_id`, `created_at`, `updated_at`) VALUES (3, 'はじめましてですよね', 3, '2020-12-12 11:44:52.656327', '2020-12-12 11:44:52.656327')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1