app/controllers/rooms_controller.rb

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`sender_id` = 2 AND `rooms`.`tweet_id` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 3
---
    def show
        @room = Room.find_by(sender_id: current_user.id, tweet_id: params[:id])
        @message = Message.new
        @messages = Message.where(room_id: @room.id)

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1
INSERT INTO `rooms` (`tweet_id`, `owner_id`, `sender_id`, `created_at`, `updated_at`) VALUES (3, 1, 2, '2020-12-13 08:01:05.006789', '2020-12-13 08:01:05.006789')
---
    def create
        tweet =  Tweet.find(params[:id])
        room = Room.new
        room.tweet_id = params[:id]
        room.sender_id = current_user.id
        room.owner_id = tweet.user_id
        room.save