app/controllers/tweets_controller.rb

INSERT INTO `tweets` (`body`, `image`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'S__33882114.jpg', 2, '2021-01-01 06:51:20.573317', '2021-01-01 06:51:20.573317')
---
    def create
        @tweet = Tweet.new(tweet_params)
        @tweet.user_id = current_user.id
        if tweet_params[:file]
            file = tweet_params[:file]
            name = file.original_filename
            @tweet.name = name
            result = uploadpdf(file,name)
        end
        #https://railsdoc.com/page/params_original_filename
        if @tweet.save