app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @roomssender = Room.where(sender_id:@user.id)
        @roomsowner = Room.where(owner_id:@user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`sender_id` = 1
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`owner_id` = 2